       program-id. Program1 as "testCobol1.Program1".

       data division.
       working-storage section.

       procedure division.

           goback.
           
       end program Program1.
